TienHuyIoT/esp_wifi_template/Manager_Wifi/esp8266_wifi_template/hth_esp_wifi.cpp
#ifdef ESP32
#include <WiFi.h>
#include <esp_wifi.h>
#include <WiFiType.h>
#include <time.h>
#include "hth_esp_event_signal.h"
#if ESP_IDF_VERSION_MAJOR >= 4
#include <esp_sntp.h>
#else
#include <lwip/apps/sntp.h>
#endif
#elif defined(ESP8266)
#include <ESP8266WiFi.h>
#include <ESP8266mDNS.h>
#include <user_interface.h>
#include <TZ.h>
#include <time.h>      // time() ctime()
#include <sys/time.h>  // struct timeval
#include <coredecls.h> // settimeofday_cb()
#include <sntp.h>      // sntp_servermode_dhcp()

#define MYTZ TZ_Asia_Ho_Chi_Minh

// OPTIONAL: change SNTP startup delay
// a weak function is already defined and returns 0 (RFC violation)
// it can be redefined:
#if (0)
uint32_t sntp_startup_delay_MS_rfc_not_less_than_60000 ()
{
   //info_sntp_startup_delay_MS_rfc_not_less_than_60000_has_been_called = true;
   return 60000; // 60s (or lwIP's original default: (random() % 5000))
}
#endif

// OPTIONAL: change SNTP update delay
// a weak function is already defined and returns 1 hour
// it can be redefined:
#if (0)
uint32_t sntp_update_delay_MS_rfc_not_less_than_15000 ()
{
  //  info_sntp_update_delay_MS_rfc_not_less_than_15000_has_been_called = true;
   return 15000; // 15s
}
#endif
#endif

#include "hth_esp_config.h"
#include "hth_serial_trace.h"
#include "hth_esp_sys_params.h"
#include "hth_esp_sys_rtc.h"
#include "hth_esp_wifi.h"

#define SNTP_CONSOLE_PORT CONSOLE_PORT
#define SNTP_CONSOLE(...) CONSOLE_LOGI(__VA_ARGS__)
#define SNTP_TAG_CONSOLE(...) CONSOLE_TAG_LOGI("[SNTP]", __VA_ARGS__)

#define ESP_WIFI_PORT CONSOLE_PORT
#define ESP_WIFI_CONSOLE(...) CONSOLE_LOGI(__VA_ARGS__)
#define ESP_WIFI_TAG_CONSOLE(...) CONSOLE_TAG_LOGI("[WIFI]", __VA_ARGS__)

#ifdef ESP32
static void sntp_sync_time_cb(struct timeval *tv) {
    SNTP_TAG_CONSOLE("settimeofday(SNTP)");
#elif defined(ESP8266)
static void sntp_sync_time_cb(bool from_sntp /* <= this parameter is optional */) {
    SNTP_TAG_CONSOLE("Callback settimeofday(%s)", from_sntp ? "SNTP" : "USER");
#endif 
    time_t now = time(nullptr);
    const tm* tm = localtime(&now);
    char buf[64];
    /** The same way using with esp32 
     * RTC_CONSOLE_PORT.println(&tmStruct, "\r\nTime: %A, %B %d %Y %H:%M:%S");
     * */
    strftime(buf, 64, "%A, %B %d %Y %H:%M:%S", tm);
    SNTP_TAG_CONSOLE("Callback Time: %s", buf);

    ESPTime.setSourceUpdate(ESPTimeSystem::RTC_SNTP_UPDATE);
}

ESPSntpService::ESPSntpService() {}
ESPSntpService::~ESPSntpService() {}

void ESPSntpService::begin()
{
    SNTP_TAG_CONSOLE("Configure Time Server");
#ifdef ESP32
    sntp_set_time_sync_notification_cb(sntp_sync_time_cb);
    configTime(_gmtOffset_sec, _daylightOffset_sec, _ntpServer1, _ntpServer2);
    // Using callback event instead to check sntp status
    // while (sntp_get_sync_status() != SNTP_SYNC_STATUS_COMPLETED) {};
#elif defined(ESP8266)
    SNTP_TAG_CONSOLE("sntp_getoperatingmode = %u", sntp_getoperatingmode());
    // install callback - called when settimeofday is called (by SNTP or user)
    // once enabled (by DHCP), SNTP is updated every hour by default
    // ** optional boolean in callback function is true when triggered by SNTP **
    settimeofday_cb(sntp_sync_time_cb);
    // OPTIONAL: disable obtaining SNTP servers from DHCP
    sntp_servermode_dhcp(0);
    configTime(_gmtOffset_sec, _daylightOffset_sec, _ntpServer1, _ntpServer2);

    // Give now a chance to the settimeofday callback,
    // because it is *always* deferred to the next yield()/loop()-call.
    yield();
#endif
}

/* ESPWifiHandler class --------------------------------------------------------
 -----------------------------------------------------------------------------
 ---------------------------------------------------------------------------*/
ESPWifiHandler::ESPWifiHandler(/* args */)
#if (defined SNTP_SERVICE_ENABLE) && (SNTP_SERVICE_ENABLE == 1)  
    : _sntp(new ESPSntpService())
#endif
#if (defined DNS_SERVER_ENABLE) && (DNS_SERVER_ENABLE == 1) 
    ,_dnsServer(new DNSServer())
#endif
{
}

ESPWifiHandler::~ESPWifiHandler()
{
#if (defined DDNS_CLIENT_ENABLE) && (DDNS_CLIENT_ENABLE == 1)  
  if (ddnsClient)
  {
    delete ddnsClient;
  }
#endif

#if (defined SNTP_SERVICE_ENABLE) && (SNTP_SERVICE_ENABLE == 1)  
  delete _sntp;
#endif

#if (defined DNS_SERVER_ENABLE) && (DNS_SERVER_ENABLE == 1) 
    delete _dnsServer;
#endif
}

#if (defined DDNS_CLIENT_ENABLE) && (DDNS_CLIENT_ENABLE == 1)  
hth_AsyncEasyDDNSClass* ESPWifiHandler::ddnsClient = nullptr;
#endif
Ticker ESPWifiHandler::_reconnetTicker;

void ESPWifiHandler::registerEventHandler()
{
  ESP_WIFI_TAG_CONSOLE("registerEventHandler");
#ifdef ESP32
  WiFi.onEvent([](WiFiEvent_t event, WiFiEventInfo_t info)
  {
    ESP_WIFI_TAG_CONSOLE("[EVENT] WiFi connected");
    ESP_WIFI_TAG_CONSOLE("[EVENT] got IP address: %s", IPAddress(info.got_ip.ip_info.ip.addr).toString().c_str());
    /* Smart config enable */
    if(ESPConfig.smartCfgSTA())
    {
      if(ESPConfig.ssidSTA() != WiFi.SSID()
      || ESPConfig.passSTA() != WiFi.psk())
      {
        ESPConfig.ssidSTASet(WiFi.SSID());
        ESPConfig.passSTASet(WiFi.psk());
        ESPConfig.save();
      }
    }
  }
  ,WiFiEvent_t::m_ESP32_EVENT_STA_GOT_IP);

  WiFi.onEvent(
      [](WiFiEvent_t event, WiFiEventInfo_t info)
      {
#if ESP_IDF_VERSION_MAJOR >= 4
        ESP_WIFI_TAG_CONSOLE("[EVENT] WiFi lost connection. Reason: %u", info.wifi_sta_disconnected.reason);
#else
        ESP_WIFI_TAG_CONSOLE("[EVENT] WiFi lost connection. Reason: %u", info.disconnected.reason);
#endif
        /* Note: running setAutoReconnect(true) when module is already disconnected 
        will not make it reconnect to the access point. Instead reconnect() 
        should be used. 
          We don't need call WiFi.reconnect() once loss connection, it is self reconnect after loss connection.
        Reconnecting will be destroy, if executing scan network.
        */
        constexpr uint32_t RECONNECT_SECOND_TIMEOUT = 15;
        // manual reconnect after an expired timeout
        _reconnetTicker.once(RECONNECT_SECOND_TIMEOUT, [](){
          ESP_WIFI_TAG_CONSOLE("Reconnecting");
          WiFi.reconnect();
        });
      },
      WiFiEvent_t::m_ESP32_EVENT_STA_DISCONNECTED);
#elif defined(ESP8266)
  // To register evetn, must be declare _accessPointGotIpHandler
  _accessPointGotIpHandler = WiFi.onStationModeGotIP(
    [](const WiFiEventStationModeGotIP& evt) {
      ESP_WIFI_TAG_CONSOLE("[EVENT] got IP address: %s", evt.ip.toString().c_str());
      /* Smart config enable */
      if(ESPConfig.smartCfgSTA())
      {
        if(ESPConfig.ssidSTA() != WiFi.SSID()
        || ESPConfig.passSTA() != WiFi.psk())
        {
          ESPConfig.ssidSTASet(WiFi.SSID());
          ESPConfig.passSTASet(WiFi.psk());
          ESPConfig.save();
        }
      }
    }
  );

  // To register evetn, must be declare _accessPointConnectedHandler
  _accessPointConnectedHandler = WiFi.onStationModeConnected(
    [](const WiFiEventStationModeConnected& evt) {
      ESP_WIFI_TAG_CONSOLE("[EVENT] WiFi connected to %s", evt.ssid.c_str());
    }
  );

