TienHuyIoT/esp_wifi_template/Manager_Wifi/esp8266_wifi_template/hth_esp_wifi.cpp
  ArduinoOTA.setHostname(ESPConfig.hostNameSTA().c_str());
  // ArduinoOTA.setPassword("1234");
  ArduinoOTA.begin();
}
#endif

void ESPWifiHandler::loop()
{
#if (defined MDNS_SERVICE_ENABLE) && (MDNS_SERVICE_ENABLE == 1) && (defined ESP8266)
  MDNS.update();
#endif

#if (defined OTA_ARDUINO_ENABLE) && (OTA_ARDUINO_ENABLE == 1)  
  ArduinoOTA.handle();
#endif
}

void ESPWifiHandler::begin(bool wifiON)
{
  WiFiMode_t wf_mode = WIFI_OFF;

  ESP_WIFI_TAG_CONSOLE("Begin()");
#if (defined SNTP_SERVICE_ENABLE) && (SNTP_SERVICE_ENABLE == 1)  
  // sntp service ON
  _sntp->begin();
#endif

  // Register wifi event callback
  this->registerEventHandler();

  if (wifiON)
  {
    ESP_WIFI_TAG_CONSOLE("Wifi start");
    /* Once WiFi.persistent(false) is called, WiFi.begin, 
     WiFi.disconnect, WiFi.softAP, or WiFi.softAPdisconnect 
     only changes the current in-memory Wi-Fi settings, 
     and does not affect the Wi-Fi settings stored in flash memory.

     Default is false
    */
    WiFi.persistent(false);
#ifdef ESP32
    esp_wifi_set_protocol(WIFI_IF_AP, WIFI_PROTOCOL_11B);
    /*
      typedef enum {
          WIFI_POWER_19_5dBm = 78,// 19.5dBm
          WIFI_POWER_19dBm = 76,// 19dBm
          WIFI_POWER_18_5dBm = 74,// 18.5dBm
          WIFI_POWER_17dBm = 68,// 17dBm
          WIFI_POWER_15dBm = 60,// 15dBm
          WIFI_POWER_13dBm = 52,// 13dBm
          WIFI_POWER_11dBm = 44,// 11dBm
          WIFI_POWER_8_5dBm = 34,// 8.5dBm
          WIFI_POWER_7dBm = 28,// 7dBm
          WIFI_POWER_5dBm = 20,// 5dBm
          WIFI_POWER_2dBm = 8,// 2dBm
          WIFI_POWER_MINUS_1dBm = -4// -1dBm
      } wifi_power_t;
      */
    WiFi.setTxPower(WIFI_POWER_19_5dBm);
#elif defined(ESP8266)
    WiFi.setPhyMode(WIFI_PHY_MODE_11B);
    WiFi.setOutputPower(20.5);
#endif

    /* sta and ap are disable*/
    if (ESPConfig.isDisableSTA() && ESPConfig.isDisableAP())
    {
      /* smart config is enable*/
      if (ESPConfig.smartCfgSTA())
      {
        wf_mode = WIFI_STA;
        ESP_WIFI_TAG_CONSOLE("Wifi Mode WIFI_STA using for smart config");
      }
      else
      {
        wf_mode = WIFI_OFF;
        ESP_WIFI_TAG_CONSOLE("Wifi Mode WIFI_OFF");
      }
    }
    /* sta and ap are enable*/
    else if (!ESPConfig.isDisableSTA() && !ESPConfig.isDisableAP())
    {
      wf_mode = WIFI_AP_STA;
      ESP_WIFI_TAG_CONSOLE("Wifi Mode WIFI_AP_STA");
    }
    /* Enable sta and Diasble ap */
    else if (!ESPConfig.isDisableSTA() && ESPConfig.isDisableAP())
    {
      wf_mode = WIFI_STA;
      ESP_WIFI_TAG_CONSOLE("Wifi Mode WIFI_STA");
    }
    /* Disable sta and Enable ap */
    else
    {
      wf_mode = WIFI_AP;
      ESP_WIFI_TAG_CONSOLE("Wifi Mode WIFI_AP");
    }

    if (WIFI_OFF == wf_mode)
    {
      this->end();
    }
    else
    {
      WiFi.mode(wf_mode);
    }

    /* STA enable */
    if (!ESPConfig.isDisableSTA())
    {
      if (ESPConfig.ssidSTA().length() > 0) // not exist the access point 
      {
        if (!ESPConfig.dhcpSTA())
        {
          WiFi.config(ESPConfig.ipSTA(), ESPConfig.gwSTA(), ESPConfig.snSTA(), ESPConfig.dnsSTA());
          ESP_WIFI_TAG_CONSOLE("static IP setup");
          ESP_WIFI_TAG_CONSOLE("Ip: %s", ESPConfig.ipSTA().toString().c_str());
          ESP_WIFI_TAG_CONSOLE("Gw: %s", ESPConfig.gwSTA().toString().c_str());
          ESP_WIFI_TAG_CONSOLE("Sn: %s", ESPConfig.snSTA().toString().c_str());
          ESP_WIFI_TAG_CONSOLE("Dns: %s\r\n", ESPConfig.dnsSTA().toString().c_str());
        }

        this->connect(ESPConfig.ssidSTA().c_str(), ESPConfig.passSTA().c_str());
      }
      else
      {
        /* Smart config enable */
        ESP_WIFI_TAG_CONSOLE("[beginSmartConfig] = %u\r\n", ESPConfig.smartCfgSTA());
        if (ESPConfig.smartCfgSTA())
        {
          WiFi.beginSmartConfig();
        }
      }
    }

    /* AP enable */
    if (!ESPConfig.isDisableAP())
    {
#ifdef ESP8266
      String ChipID = String(ESP.getChipId(), HEX);
#elif defined(ESP32)
      String ChipID = String((uint32_t)(ESP.getEfuseMac() >> 16), HEX);
#endif
      ChipID.toUpperCase();
      String ssidAP = ESPConfig.ssidAP() + "_" + ChipID;
      WiFi.softAPConfig(ESPConfig.ipAP(), ESPConfig.ipAP(), ESPConfig.snAP());
      constexpr uint8_t PASSWORD_LENGTH_MIN = 8;
      if (ESPConfig.passAP().length() >= PASSWORD_LENGTH_MIN)
      {
        // using c_str() for esp32
        WiFi.softAP(ssidAP.c_str(), ESPConfig.passAP().c_str(), ESPConfig.channelAP(), ESPConfig.isHiddenAP());
      }
      else
      {
        // using c_str() for esp32
        WiFi.softAP(ssidAP.c_str());
      }

      ESP_WIFI_TAG_CONSOLE("AP IP address: %s\r\n", WiFi.softAPIP().toString().c_str());
    }
  }
  /* should be called after the wifi init */
#if (defined OTA_ARDUINO_ENABLE) && (OTA_ARDUINO_ENABLE == 1)  
  this->onArduinoOTA();
#endif

#if (defined DDNS_CLIENT_ENABLE) && (DDNS_CLIENT_ENABLE == 1)  
  if (!ESPConfig.isDisableSTA())
  {
    this->onDDNSclient();
  }
#endif

#if (defined NBNS_SERVICE_ENABLE) && (NBNS_SERVICE_ENABLE == 1)
  if (!ESPConfig.isDisableSTA())
  {
    this->onNBNSService();
  }
#endif

#if (defined MDNS_SERVICE_ENABLE) && (MDNS_SERVICE_ENABLE == 1)
  if (!ESPConfig.isDisableSTA())
  {
    this->onMDNSService();
  }
#endif

#if (defined DNS_SERVER_ENABLE) && (DNS_SERVER_ENABLE == 1)
  if (!ESPConfig.isDisableAP())
  {
    this->onDNSServer();
  }
#endif
}

void ESPWifiHandler::end(void)
{
  if (WIFI_OFF != WiFi.getMode())
  {
    ESP_WIFI_TAG_CONSOLE("Wifi off\r\n");
    WiFi.disconnect(true);
    WiFi.enableAP(false);
  }
  WiFi.mode(WIFI_OFF);

  // force wifi off. We must be run the function to getmode() is really return WIFI_OFF
#ifdef ESP32
  esp_wifi_set_mode(WIFI_OFF);
#elif defined(ESP8266)
  // Refer example details
  // https://github.com/esp8266/Arduino/blob/master/libraries/esp8266/examples/interactive/interactive.ino
  wifi_set_opmode(WIFI_OFF);
#endif
}

void ESPWifiHandler::connect(const char *name, const char *pass)
{
  // We start by connecting to a WiFi network
  ESP_WIFI_TAG_CONSOLE("Connecting to %s", name);

  /* - Set whether module will attempt to reconnect
     to an access point in case it is disconnected.

     WiFi.setAutoReconnect(autoReconnect)
     - If parameter autoReconnect is set to true, then module will try to 
     reestablish lost connection to the AP. 
     - If set to false then module will stay disconnected.

     Note: running setAutoReconnect(true) when module is already disconnected 
     will not make it reconnect to the access point. Instead reconnect() 
     should be used.
    */
  WiFi.setAutoReconnect(false);
  constexpr uint8_t PASSWORD_LENGTH_MIN = 8;
  if (strlen(pass) >= PASSWORD_LENGTH_MIN)
  {
    WiFi.begin(name, pass);
  }
  else
  {
    WiFi.begin(name);
  }

